Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.MissingParent
No parent [EntryType] '[Code]' for '[Code]'

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.DuplicateEntry
Duplicate code '[Code]', description: '[Description]'

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.CircularParentage
A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.BadClassificationLevel
Level [Level] of Classification [Code] is not an integer from 1 to 5.

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures
Failures about KeyBasedTreeEntry.